{
  "posts": [
    {
      "title": "Гималайский медведь: Создатель легенды о йети.",
      "body": "Знаете, как рождаются легенды о снежных людях и тому подобные сюжеты? От большой глупости и незнания природы собственной страны! Слышали, например, байки о «множестве странных поломанных веток, огромных гнёздах на самой верхушке деревьев, странных волосатых людях, что быстро убегают, когда их заметишь»? Так вот, никакие это не йети, это всего лишь обычные гималайские медведи (Ursus thibetanus). И да, это они строят мега-гнёзда на деревьях, — просто потому что живут там!\n\nГималайские, белогрудые, или азиатские чёрные медведи, — одни из самых необычных представителей семейства медвежьих. Выглядят косолапые совсем как ожившие мягкие игрушки: насыщенный чёрный окрас, шелковистая блестящая шерсть и смешные торчащие уши. Прелесть!",
      "authorId": 2,
      "id": 1
    },
    {
      "title": "Половой диморфизм — страшная вещь.",
      "body": "У нас, людей, он крайне умеренный, но и этого хватает, чтобы бесконечно спорить о правах, обязанностях и положении в обществе. А ведь в природе встречаются настолько сильные различия между полами, что носителей разного набора половых хромосом можно принять за отдельные виды!\n\nПосмотрите на картинку ниже. Вы бы приняли этих двух попугаев за представителей одного вида? Вот и орнитологи, изучавшие орнитофауну тропических лесов Индонезии, оставили записи, в которых чётко указывали, что встретили два разных вида попугаев. Лишь дальнейшее (и довольно длительное!) наблюдение показало, что перед нами благородный красно-зелёный попугай, чей половой диморфизм дошёл до крайности. Причём яркими и красными у этих попугаев являются самки, а самцы — лишь скромные зелёные трудяжки. Обычно у птиц всё наоборот.",
      "authorId": 1,
      "id": 2
    },
    {
      "title": "Что пьют киты?",
      "body": "Они ведь млекопитающие, а значит им, также как и нам, жизненно необходима обычная пресная вода — так уж устроены наши организмы. Но где морские обитатели её берут, если вокруг них сплошной солёный океан?\n\nНигде. Солёную воду животины, как и мы, пить не могут, ведь их почки не способны отфильтровать её до пресного состояния. Однако, киты, дельфины, косатки и прочие китообразные в процессе эволюции научились утолять жажду другим способом. Всю необходимую жидкость они получают из своей добычи. Очень удобно, ведь получается что они и едят, и пьют одновременно!",
      "authorId": 3,
      "id": 3
    }
  ],
  "comments": [
    {
      "id": 1,
      "body": "Собаки глупые, это я доказал",
      "forPostId": 1
    },
    {
      "id": 2,
      "body": "Собаки прекрасные животные, умнее кошек и того мужика сверху",
      "forPostId": 1
    },
    {
      "id": 3,
      "body": "Ахринеееееть!!!",
      "forPostId": 3
    }
  ],
  "profiles": [
    {
      "id": 1,
      "name": "Света",
      "avatar": "img/avatars/testUser1_avatar.png"
    },
    {
      "id": 2,
      "name": "Виталя",
      "avatar": "img/avatars/testUser2_avatar.png"
    },
    {
      "id": 3,
      "name": "Дункан",
      "avatar": "img/avatars/testUser3_avatar.png"
    }
  ]
}
